#!/bin/bash

if [ "$#" -le 1 ]; then
    echo "Nedovolen broj na argumenti"
else
    for dat in "$@"; do
        z=$(find . -type f -name "$dat")

        if [ -n "$z" ]; then
            ./python_script.py3 "$z"
            out_file="${z}_out"
            datumi=$(grep -E '^[0-9]{2}-[0-9]{2}-[0-9]{4}' "$out_file" | wc -l)
            echo "${dat}: pronajdeni $datumi"
        fi
    done
fi

#  Да се напише SHELL скрипта која како аргумент добива листа од имиња од датотеки. Скриптата, за
# секоја датотека (име од датотека) да провери дали ја има како датотека во тековниот директориум, или
# под-директориуми. Доколку ја има, проверува дали датотеката (во нејзината содржина) има барем еден
# валиден датум (DD-MM-YYYY), и доколку нема, ја игнорира. Доколку има валиден датум, тогаш ја
# повикува Python скриптата и како прв аргумент го праќа името на датотеката, и т.н. со сите датотеки што
# се пратени како аргументи од командна линија. За секоја датотека што ќе биде пратена
# на Python скриптата, се печати на екран нејзиното име и колку различни датуми се пронајдени.