# Да се напише Shell скрипта која треба да ги најде сите датотеки во тековниот директориум (и под-директориуми) чие што
# име завршува на екстензија „.crypto“. Потоа, за сите најдени датотеки, скриптата треба да провери во кои датотеки има барем еден
# од следниве крипто-валути како збор: BTC, Doge, EOS, ETH и XPM. Оние датотеки што го исполнуваат условот, нивната содржина се
# спојува во датотека со име „all.crypto“ (оваа датотека не постои, треба да се креира во тековниот директориум) а потоа се повикува
# Python скриптата од претходната задача, каде како аргумент и се испраќа датотеката „all.crypto“. Shell скриптата на екран печати
# колку крипто-вредности има пронајдено Python скриптата од претходната задача. 

#!/bin/bash

touch all.crypto

for dat in $(find . -type f -name "*.crypto"); do
	z=$(grep -E 'BTC|Doge|EOS|ETH|XMP' "$dat")
	if [ -n "$z" ]; then
		cat "$dat" >> all.crypto 
	fi
done
output=$(./python_scripta all.crypto | wc -l)
echo "Prionajdeni se tocno $output cryptovaluti" 
